# Human resources in R & D

# Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os
import warnings

# Options and Settings

In [2]:
%matplotlib inline
plt.style.use('ggplot')
plt.rcParams['figure.autolayout'] = True
plt.rcParams['figure.figsize'] = [12, 9]
plt.rcParams['font.size'] = 12
path = os.getcwd()                                         # get current working directory
warnings.simplefilter('ignore')

# Import Data

In [3]:
filepath = os.path.join('datasets', 'Research Development Staff.csv')
df = pd.read_csv(filepath)

# Head and Tail

In [4]:
df

,Region/Country/Area,Unnamed: 1,Year,Series,Value,Footnotes,Source,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,8,Albania,2008,R & D personnel: Total (number in full-time eq...,779,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
1,8,Albania,2008,R & D personnel: Researchers - total (number i...,467,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
2,8,Albania,2008,R & D personnel: Researchers - women (number i...,207,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
3,8,Albania,2008,R & D personnel: Technicians - total (number i...,120,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
4,8,Albania,2008,R & D personnel: Other supporting staff - tota...,192,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
2567,716,Zimbabwe,2012,R & D personnel: Researchers - women (number i...,332,NaN,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
2568,716,Zimbabwe,2012,R & D personnel: Technicians - total (number i...,141,Excluding business enterprise.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
2569,716,Zimbabwe,2012,R & D personnel: Technicians - women (number i...,41,NaN,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
2570,716,Zimbabwe,2012,R & D personnel: Other supporting staff - tota...,295,Excluding business enterprise.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
2571,716,Zimbabwe,2012,R & D personnel: Other supporting staff - wome...,100,NaN,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN

In [5]:
df.shape

(2572, 10)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2572 entries, 0 to 2571
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Region/Country/Area  2572 non-null   int64
 1   Unnamed: 1           2572 non-null   object
 2   Year                 2572 non-null   int64
 3   Series               2572 non-null   object
 4   Value                2572 non-null   int64
 5   Footnotes            1391 non-null   object
 6   Source               2572 non-null   object
 7   Unnamed: 7           494 non-null    object
 8   Unnamed: 8           125 non-null    object
 9   Unnamed: 9           31 non-null     object
dtypes: int64(3), object(7)
memory usage: 201.1+ KB

In [7]:
df.rename(columns={'Region/Country/Area': 'Code', 
                   'Unnamed: 1': 'Country/Area',
                   }, inplace=True)

df.head()

,Code,Country/Area,Year,Series,Value,Footnotes,Source,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,8,Albania,2008,R & D personnel: Total (number in full-time eq...,779,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
1,8,Albania,2008,R & D personnel: Researchers - total (number i...,467,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
2,8,Albania,2008,R & D personnel: Researchers - women (number i...,207,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
3,8,Albania,2008,R & D personnel: Technicians - total (number i...,120,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN
4,8,Albania,2008,R & D personnel: Other supporting staff - tota...,192,Partial data.,"United Nations Educational, Scientific and Cul...",NaN,NaN,NaN

In [8]:
df1 = df[['Code', 'Country/Area', 'Year', 'Series', 'Value']]
df1

,Code,Country/Area,Year,Series,Value
0,8,Albania,2008,R & D personnel: Total (number in full-time eq...,779
1,8,Albania,2008,R & D personnel: Researchers - total (number i...,467
2,8,Albania,2008,R & D personnel: Researchers - women (number i...,207
3,8,Albania,2008,R & D personnel: Technicians - total (number i...,120
4,8,Albania,2008,R & D personnel: Other supporting staff - tota...,192
...,...,...,...,...,...
2567,716,Zimbabwe,2012,R & D personnel: Researchers - women (number i...,332
2568,716,Zimbabwe,2012,R & D personnel: Technicians - total (number i...,141
2569,716,Zimbabwe,2012,R & D personnel: Technicians - women (number i...,41
2570,716,Zimbabwe,2012,R & D personnel: Other supporting staff - tota...,295
2571,716,Zimbabwe,2012,R & D personnel: Other supporting staff - wome...,100

In [9]:
df1.shape

(2572, 5)

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2572 entries, 0 to 2571
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Code          2572 non-null   int64
 1   Country/Area  2572 non-null   object
 2   Year          2572 non-null   int64
 3   Series        2572 non-null   object
 4   Value         2572 non-null   int64
dtypes: int64(3), object(2)
memory usage: 100.6+ KB

In [11]:
df1.describe(include='object')

       Country/Area                                             Series
count          2572                                               2572
unique          157                                                  7
top      Luxembourg  R & D personnel: Researchers - total (number i...
freq             34                                                497

In [12]:
df1['Country/Area'].value_counts()

Luxembourg                    34
Slovenia                      30
Ireland                       30
Estonia                       30
Cyprus                        30
                              ..
Guam                           1
Faroe Islands                  1
Saint Vincent & Grenadines     1
Benin                          1
Greenland                      1
Name: Country/Area, Length: 157, dtype: int64

In [13]:
df1['Series'].value_counts()

R & D personnel: Researchers - total (number in full-time equivalent)               497
R & D personnel: Total (number in full-time equivalent)                             449
R & D personnel: Technicians - total (number in full-time equivalent)               405
R & D personnel: Other supporting staff - total (number in full-time equivalent)    380
R & D personnel: Researchers - women (number in full-time equivalent)               355
R & D personnel: Technicians - women (number in full-time equivalent)               245
R & D personnel: Other supporting staff - women (number in full-time equivalent)    241
Name: Series, dtype: int64

In [14]:
df1['Code'].value_counts()

442    34
705    30
372    30
233    30
196    30
       ..
316     1
234     1
670     1
204     1
304     1
Name: Code, Length: 157, dtype: int64

# Data Cleaning

In [15]:
df1['Country/Area'].replace(
    {'Cï¿½te dï¿½Ivoire': "CÃ´te dâ€™Ivoire"}, inplace=True)

df1['Country/Area'].unique()

array(['Albania', 'Algeria', 'American Samoa', 'Angola', 'Argentina',
       'Armenia', 'Australia', 'Austria', 'Azerbaijan', 'Bahrain',
       'Belarus', 'Belgium', 'Benin', 'Bermuda',
       'Bolivia (Plurin. State of)', 'Bosnia and Herzegovina', 'Botswana',
       'Brazil', 'Brunei Darussalam', 'Bulgaria', 'Burkina Faso',
       'Burundi', 'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada',
       'Central African Republic', 'Chad', 'Chile', 'China',
       'China, Hong Kong SAR', 'China, Macao SAR', 'Colombia', 'Congo',
       'Costa Rica', 'CÃ´te dâ€™Ivoire', 'Croatia', 'Cuba', 'Cyprus',
       'Czechia', 'Dem. Rep. of the Congo', 'Denmark', 'Ecuador', 'Egypt',
       'El Salvador', 'Estonia', 'Eswatini', 'Ethiopia', 'Faroe Islands',
       'Finland', 'France', 'Gabon', 'Gambia', 'Georgia', 'Germany',
       'Ghana', 'Greece', 'Greenland', 'Guam', 'Guatemala', 'Guinea',
       'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran (Islamic Republic of)', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kuwait', 'Kyrgyzstan',
       'Latvia', 'Lesotho', 'Libya', 'Lithuania', 'Luxembourg',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Malta', 'Mauritania',
       'Mauritius', 'Mexico', 'Monaco', 'Mongolia', 'Montenegro',
       'Morocco', 'Mozambique', 'Myanmar', 'Namibia', 'Nepal',
       'Netherlands', 'New Zealand', 'Niger', 'Nigeria',
       'North Macedonia', 'Norway', 'Oman', 'Pakistan', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Qatar', 'Republic of Korea',
       'Republic of Moldova', 'Romania', 'Russian Federation', 'Rwanda',
       'Saint Helena', 'Saint Vincent & Grenadines', 'Saudi Arabia',
       'Senegal', 'Serbia', 'Seychelles', 'Singapore', 'Slovakia',
       'Slovenia', 'South Africa', 'Spain', 'Sri Lanka',
       'State of Palestine', 'Sudan', 'Sudan [former]', 'Sweden',
       'Switzerland', 'Syrian Arab Republic', 'Tajikistan', 'Thailand',
       'Togo', 'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Uganda',
       'Ukraine', 'United Arab Emirates', 'United Kingdom',
       'United Rep. of Tanzania', 'United States of America',
       'United States Virgin Islands', 'Uruguay', 'Uzbekistan',
       'Venezuela (Boliv. Rep. of)', 'Viet Nam', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [16]:
df1['Year'].value_counts().head()

2015    548
2010    477
2005    412
2018    354
2017    242
Name: Year, dtype: int64

In [17]:
df1['Value'].describe()

count    2.572000e+03
mean     3.407669e+04
std      1.676496e+05
min      1.000000e+00
25%      4.020000e+02
50%      2.179500e+03
75%      1.480400e+04
max      4.381444e+06
Name: Value, dtype: float64

# Missing Values Exploration

In [18]:
df1.isna().sum()

Code            0
Country/Area    0
Year            0
Series          0
Value           0
dtype: int64